# SortEntries Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ColorFillScheme..::..SortEntries Method
ColorFillScheme Class See Also
---
Sorts the scheme entries ascending.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public void SortEntries()
```

Visual Basic
---
```text
Public Sub SortEntries
```

Visual C++
---
```text
public:
void SortEntries()
```

# Remarks
If the scheme parameter value storage type is ElementId, then the order of entries would be based on the name of the elements.
# See Also
ColorFillScheme Class
Autodesk.Revit.DB Namespace